app/controllers/home_controller.rb

SELECT "posts".* FROM "posts"
SELECT  "users".* FROM "users" WHERE "users"."username" IS NULL LIMIT 1
---
  def index
    @posts = Post.all
    @user = User.find_by(username: params[:username])