app/controllers/posts_controller.rb

  def show
     @post = Post.find_by id: params[:id]
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 0]]

  def create
    @post = Post.new
    @post.text = params[:post][:text]
    @post.user = @current_user
    if @post.save
---
INSERT INTO "posts" ("text", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["text", "test"], ["user_id", 1], ["created_at", "2016-03-15 21:25:52.437813"], ["updated_at", "2016-03-15 21:25:52.437813"]]