app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" IS NULL LIMIT 1
---
  def show
     @user = User.find_by(username: params[:username])

INSERT INTO "users" ("email", "username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @user = User.new params.require(:user).permit(:username, :password, :password_confirmation)
   if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" LIMIT 1
---
  def follow
    @user = User.find_by(params[:username])
    user_id = session[:user_id]
    @current_user = User.find_by id: user_id
    if @current_user.present?